# 实习二 数据库约束设计
## 练习一 生成身份证号
小组成员：郝泽成 蔡亚伦 赵泽骏

```下述函数及存储过程均在本地mysql-client远程连接下定义```

In [2]:
mysql://stu2000012974:stu2000012974@162.105.146.37:43306

In [8]:
use stu2000012974;

In [ ]:
DELIMITER $$

CREATE FUNCTION getCheckDigit(prefix VARCHAR(1000))
RETURNS VARCHAR(10)
BEGIN
    DECLARE ans INT DEFAULT 0;
    DECLARE ret VARCHAR(10);

    SET ans = ans + 7 * CONVERT(SUBSTRING(prefix, 1, 1), SIGNED);
    SET ans = ans + 9 * CONVERT(SUBSTRING(prefix, 2, 1), SIGNED);
    SET ans = ans + 10 * CONVERT(SUBSTRING(prefix, 3, 1), SIGNED);
    SET ans = ans + 5 * CONVERT(SUBSTRING(prefix, 4, 1), SIGNED);
    SET ans = ans + 8 * CONVERT(SUBSTRING(prefix, 5, 1), SIGNED);
    SET ans = ans + 4 * CONVERT(SUBSTRING(prefix, 6, 1), SIGNED);
    SET ans = ans + 2 * CONVERT(SUBSTRING(prefix, 7, 1), SIGNED);
    SET ans = ans + 1 * CONVERT(SUBSTRING(prefix, 8, 1), SIGNED);
    SET ans = ans + 6 * CONVERT(SUBSTRING(prefix, 9, 1), SIGNED);
    SET ans = ans + 3 * CONVERT(SUBSTRING(prefix, 10, 1), SIGNED);
    SET ans = ans + 7 * CONVERT(SUBSTRING(prefix, 11, 1), SIGNED);
    SET ans = ans + 9 * CONVERT(SUBSTRING(prefix, 12, 1), SIGNED);
    SET ans = ans + 10 * CONVERT(SUBSTRING(prefix, 13, 1), SIGNED);
    SET ans = ans + 5 * CONVERT(SUBSTRING(prefix, 14, 1), SIGNED);
    SET ans = ans + 8 * CONVERT(SUBSTRING(prefix, 15, 1), SIGNED);
    SET ans = ans + 4 * CONVERT(SUBSTRING(prefix, 16, 1), SIGNED);
    SET ans = ans + 2 * CONVERT(SUBSTRING(prefix, 17, 1), SIGNED);
    SET ans = MOD(ans, 11);
    IF ans = 0 THEN SET ret = '1';
    ELSEIF ans = 1 THEN SET ret = '0';
    ELSEIF ans = 2 THEN SET ret = 'X';
    ELSEIF ans = 3 THEN SET ret = '9';
    ELSEIF ans = 4 THEN SET ret = '8';
    ELSEIF ans = 5 THEN SET ret = '7';
    ELSEIF ans = 6 THEN SET ret = '6';
    ELSEIF ans = 7 THEN SET ret = '5';
    ELSEIF ans = 8 THEN SET ret = '4';
    ELSEIF ans = 9 THEN SET ret = '3';
    ELSE SET ret = '2';
    END IF;
    RETURN ret;
END;
$$
                              
DELIMITER ;

In [10]:
select getCheckDigit('00000000010010000');

,getCheckDigit('00000000010010000')
0,X

In [21]:
select *
from dataset.xzqh t1, dataset.xzqh t2
where t1.name = t2.name
and t1.code < t2.code
and substring(t1.code, 1, 2) = substring(t2.code, 1, 2);

,code,name,code,name
0,130104,桥西区,130503,桥西区
1,130502,桥东区,130702,桥东区
2,130503,桥西区,130703,桥西区
3,130104,桥西区,130703,桥西区
4,130105,新华区,130902,新华区
5,140302,城区,140502,城区
6,210106,铁西区,210303,铁西区
7,230402,向阳区,230803,向阳区
8,320106,鼓楼区,320302,鼓楼区
9,370103,市中区,370402,市中区
10,511002,市中区,511102,市中区

由上述查询结果可知最细粒度的区名存在重名现象，故不能只根据区名选择前六位。

In [ ]:
DELIMITER $$

CREATE PROCEDURE getID(province VARCHAR(20), 
                       city VARCHAR(20), 
                       district VARCHAR(20), 
                       birthday DATE, 
                       sex VARCHAR(20))
BEGIN
    SELECT CONCAT(t1.code, 
                  DATE_FORMAT(birthday, '%Y%m%d'),
                  CONVERT(FLOOR(RAND() * 9), CHAR),
                  CONVERT(FLOOR(RAND() * 9), CHAR),
                  CASE sex 
                      WHEN '男' THEN CONVERT(1 + 2 * FLOOR(RAND() * 4), CHAR)         
                      ELSE CONVERT(2 * FLOOR(RAND() * 4), CHAR)
                  END,
                  getCheckDigit(CONCAT(t1.code, 
                                      DATE_FORMAT(birthday, '%Y%m%d'),
                                      CONVERT(FLOOR(RAND() * 9), CHAR),
                                      CONVERT(FLOOR(RAND() * 9), CHAR),
                                      CASE sex 
                                          WHEN '男' THEN CONVERT(1 + 2 * FLOOR(RAND() * 4), CHAR)         
                                          ELSE CONVERT(2 * FLOOR(RAND() * 4), CHAR)
                                      END))) ID
    FROM dataset.xzqh t1, dataset.xzqh t2, dataset.xzqh t3
    WHERE t1.name = district
    AND t2.name = city
    AND t3.name = province
    AND SUBSTRING(t1.code, 1, 2) = SUBSTRING(t3.code, 1, 2)
    AND SUBSTRING(t1.code, 3, 2) = SUBSTRING(t2.code, 3, 2);
END;
$$

DELIMITER ;

上述存储过程认为除出生日期为Date类型外，其他输入均为字符串类型。

In [25]:
call getID('河北省', '张家口市', '桥西区', now(), '男');

,ID
0,13070320220507265X

In [26]:
call getID('河北省', '石家庄市', '桥西区', now(), '男');

,ID
0,130104202205073358

## 练习二 触发器
⼩组成员：郝泽成 蔡亚伦 赵泽骏

In [39]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [40]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu1900012992:stu1900012992@162.105.146.37:43306

In [3]:
%sql show databases

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[('dataset',), ('information_schema',), ('stu1900012992',)]

In [41]:
%sql use dataset;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [42]:
%sql use stu1900012992;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [43]:
%%sql 
DROP TABLES my_stock;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [44]:
%%sql 
DROP TABLES trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [45]:
%%sql 
DROP TABLES transmore;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [46]:
%%sql 
show tables;

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [47]:
%%sql 
CREATE TABLE my_stock #创建表格《我所持有的股票》
(
    stock_id INT PRIMARY KEY,
    volume INT,
    avg_price DOUBLE,
    profit DOUBLE
    
);

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [48]:
%%sql 
CREATE TABLE transmore #这是一个辅助的表格，主要用于帮助处理卖出股票时的计算
(
    trans_id INT PRIMARY KEY,
    stock_id INT,
    price INT,
    amount INT
    
);

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [49]:
%%sql 
CREATE TABLE trans #创建表格《交易记录》
(
    trans_id INT PRIMARY KEY,
    stock_id INT,
    date INT,
    price INT,
    amount INT,
    sell_or_buy CHAR(1)
);

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

In [50]:
%%sql 
DROP TRIGGER t1;

 * mysql://stu1900012992:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1360, 'Trigger does not exist')
[SQL: DROP TRIGGER t1;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [51]:
%%sql 
show tables;

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[('my_stock',), ('trans',), ('transmore',)]

In [52]:
%%sql
CREATE TRIGGER t1 #这是本练习唯一的一个触发器，用于在插入trans记录时调整my_stock中平均持仓价格、volume、利润等信息
BEFORE INSERT ON trans
FOR EACH ROW
BEGIN
  IF (NOT EXISTS(SELECT * FROM my_stock WHERE stock_id=NEW.stock_id)) THEN
      INSERT INTO my_stock
      VALUES(NEW.stock_id,0,0,0); #如果之前my_stock中还未出现本股票，则需插入
    END IF;
  IF (NEW.sell_or_buy='B') THEN #处理买入的交易
    UPDATE my_stock 
    SET avg_price=(volume*avg_price+NEW.price*NEW.amount)/(NEW.amount+volume) 
    WHERE stock_id=NEW.stock_id ;
    UPDATE my_stock 
    SET volume=volume+NEW.amount 
    WHERE stock_id=NEW.stock_id;
    INSERT INTO transmore
     VALUES(NEW.trans_id,NEW.stock_id,NEW.price,NEW.amount);
    END IF;
    IF (NEW.sell_or_buy='S' AND NEW.amount>(SELECT volume FROM my_stock WHERE stock_id=NEW.stock_id)) THEN
    signal sqlstate '45000' ; #如果一次卖出的股票数量大于所持有的股票数量，则本交易无效，应当拒绝
    END IF;
    IF (NEW.sell_or_buy='S' AND NEW.amount<=(SELECT volume FROM my_stock WHERE stock_id=NEW.stock_id) ) THEN #处理合法的卖出交易
    BEGIN
    DECLARE AMT INT ;
    DECLARE A INT ;
    DECLARE PROFI INT ;
    DECLARE I INT ;
    DECLARE N INT ;
    DECLARE M INT ;
    DECLARE TID INT;
    DECLARE SID INT;
    DECLARE PRIC INT;
    DECLARE SELLPRICE INT;
    SET AMT=NEW.amount;
    SET I=0;
    SET PROFI=0;
    SELECT COUNT(*) FROM transmore INTO N;
    UPDATE my_stock 
    #SET avg_price=volume*avg_price 此处我出现了理解的偏差，由于我缺乏股票方面的知识，加之群里之前有两位同学讨论过这个问题
    #我曾误以为卖出股票时重新计算平均持仓价格是减去买入时的价格而不是卖出时的价格，我以为平均价格不可能为负数，现经过
    #老师在群中提示，我对此做出修改
    SET avg_price=(volume*avg_price-NEW.price*NEW.amount)/(volume-NEW.amount) 
    WHERE stock_id=NEW.stock_id;
    WHILE AMT>0  DO
    SET TID=(SELECT trans_id FROM transmore LIMIT I,1);
    SET PRIC=(SELECT price FROM trans WHERE trans_id=(SELECT trans_id FROM transmore LIMIT I,1));
    SET A=(SELECT amount FROM transmore WHERE trans_id=TID);
    SET SID=(SELECT stock_id FROM transmore WHERE trans_id=TID);
    IF SID=NEW.stock_id THEN
    IF AMT<=A  THEN
    #UPDATE my_stock 此皆因上述原因做出修改
    #SET avg_price=avg_price-PRIC*AMT
   # WHERE stock_id=NEW.stock_id;
    SET PROFI=PROFI+(NEW.price-PRIC)*AMT;
    UPDATE transmore
    SET amount=amount-AMT
    WHERE trans_id=TID;
    SET AMT=0;
    ELSE 
    #UPDATE my_stock 此皆因上述原因做出修改
    #SET avg_price=avg_price-PRIC*A
    #WHERE stock_id=NEW.stock_id;
    SET PROFI=PROFI+(NEW.price-PRIC)*A;
    UPDATE transmore
    SET amount=0
    WHERE trans_id=TID;
    SET AMT=AMT-A;
    END IF;
    END IF;
    SET I=I+1;
    END WHILE;
   # UPDATE my_stock 
   # SET avg_price=avg_price/(volume-NEW.amount)
    #WHERE stock_id=NEW.stock_id;
    UPDATE my_stock 
    SET volume=volume-NEW.amount 
    WHERE stock_id=NEW.stock_id;
    UPDATE my_stock 
    SET profit=profit+PROFI
    WHERE stock_id=NEW.stock_id;
    END;
    END IF;
END

 * mysql://stu1900012992:***@162.105.146.37:43306
0 rows affected.

[]

从下面开始，逐行输入老师给出的测试数据，并在每一次插入后都展示trans和my_stock两张表的情况，可以发现每一次的结果都是正确的。

In [54]:
%%sql
INSERT INTO trans values (1,1,1,10,1000,"B");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [55]:
%%sql 
select * from trans

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 1, 1, 10, 1000, 'B')]

In [56]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 1000, 10.0, 0.0)]

In [57]:
%%sql
INSERT INTO trans values (2,1,2,11,500,"B");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [58]:
%%sql 
select * from trans

 * mysql://stu1900012992:***@162.105.146.37:43306
2 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B')]

In [59]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 1500, 10.333333333333334, 0.0)]

In [60]:
%%sql
INSERT INTO trans values (3,1,3,12,800,"S");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [61]:
%%sql
select * from trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B'), (3, 1, 3, 12, 800, 'S')]

In [62]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 700, 8.428571428571429, 1600.0)]

In [63]:
%%sql
INSERT INTO trans values (4,1,4,12,1000,"S"); #这是一个无效的卖出交易，当予以拒绝

 * mysql://stu1900012992:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Unhandled user-defined exception condition')
[SQL: INSERT INTO trans values (4,1,4,12,1000,"S");]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [64]:
%%sql
select * from trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
3 rows affected.

[(1, 1, 1, 10, 1000, 'B'), (2, 1, 2, 11, 500, 'B'), (3, 1, 3, 12, 800, 'S')]

In [65]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 700, 8.428571428571429, 1600.0)]

In [66]:
%%sql
INSERT INTO trans values (5,1,5,9,1000,"B");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [67]:
%%sql
select * from trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
4 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B')]

In [68]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 1700, 8.764705882352942, 1600.0)]

In [69]:
%%sql
INSERT INTO trans values (6,1,6,12,800,"S");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [70]:
%%sql
select * from trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
5 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S')]

In [71]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 900, 5.888888888888891, 2800.0)]

In [72]:
%%sql
INSERT INTO trans values (7,1,7,7,800,"S");

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[]

In [73]:
%%sql
select * from trans;

 * mysql://stu1900012992:***@162.105.146.37:43306
6 rows affected.

[(1, 1, 1, 10, 1000, 'B'),
 (2, 1, 2, 11, 500, 'B'),
 (3, 1, 3, 12, 800, 'S'),
 (5, 1, 5, 9, 1000, 'B'),
 (6, 1, 6, 12, 800, 'S'),
 (7, 1, 7, 7, 800, 'S')]

In [74]:
%%sql 
select * from my_stock

 * mysql://stu1900012992:***@162.105.146.37:43306
1 rows affected.

[(1, 100, -2.999999999999982, 1200.0)]